/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2020,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：一群：179029047(已满)  二群：244861897(已满)  三群：824575535
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file            zf_systick
 * @company         成都逐飞科技有限公司
 * @author          逐飞科技(QQ790875685)
 * @version         查看doc内version文件 版本说明
 * @Software        MounRiver Studio V1.3
 * @Target core     CH32V103R8T6
 * @Taobao          https://seekfree.taobao.com/
 * @date            2020-12-04
 ********************************************************************************************************************/
#include "zf_systick.h"
#include "core_riscv.h"
#include "rtthread.h"
//-------------------------------------------------------------------------------------------------------------------
//  @brief      嘀嗒定时器延时
//  @param      time                us
//  @return     void
//  Sample usage:                   内部使用，用户无需关心
//-------------------------------------------------------------------------------------------------------------------
void systick_delay(uint16 time)
{
    uint8 i;
    do{
        i = 5;
        while(--i);
    }while(--time);
}

//-------------------------------------------------------------------------------------------------------------------
//  @brief      嘀嗒定时器延时
//  @param      time                ms
//  @return     void
//  Sample usage:                   内部使用，用户无需关心
//-------------------------------------------------------------------------------------------------------------------
void systick_delay2(uint64 time)
{
    rt_thread_mdelay(time);//调用RTT软件延时 建议使用 释放性能
}


//-------------------------------------------------------------------------------------------------------------------
//  @brief      获得当前System tick timer的值
//  @return     返回当前System tick timer的值
//  Sample usage:               uint32 tim = systick_getval();
//-------------------------------------------------------------------------------------------------------------------
uint32 systick_getval(void)
{
    return (*(volatile uint32*)0xE000F004);
}


